; lab2: 문자열 출력하기2
; programmed by goat-kim 2023
; 0: stdin, 1: stdout
; 3번 스택에서 시작

; Goat is GOAT
; 71 111 97 116 32 105 115 32 71 79 65 84
push 2, 30	; $ 60
dup	 11, 3	; $ 60 60 60 60 60 60 60 60 60 60 60 60
; (G) 71=60+10+1
push 2, 5   ; $ 10 60 60 60 60 60 60 60 60 60 60 60
push 1, 1   ; $ 1  10 60 60 60 60 60 60 60 60 60 60 60
popa 2, 3   ; $ 11 60 60 60 60 60 60 60 60 60 60 60
popa 2, 1   ; $ 60 60 60 60 60 60 60 60 60 60; G
; (o) 111=60+50+1
push 5, 10  ; $ 50 60 60 60 60 60 60 60 60 60 60; G
push 1, 1   ; $ 1  50 60 60 60 60 60 60 60 60 60 60; G
popa 3, 1   ; $ 60 60 60 60 60 60 60 60 60; Go
; (a) 97=60+30+7
push 5, 6
push 1, 7
popa 3, 1
; (t) 116=60+50+6
push 5, 10
push 2, 3
popa 3, 1
; ( ) 32=60-28
push 4, 7
neg  1, 4
popa 2, 1
; (i) 105=60+45
push 5, 9
popa 2, 1
; (s) 115=60+55
push 5, 11
popa 2, 1
; () 32=60-27
push 4, 7
neg  1, 4
popa 2, 1
; 71=60+11
push 1, 11
popa 2, 1
; 79=60+19
push 1, 19
popa 2, 1
; 65=60+5
push 1, 5
popa 2, 1
; 84=60+24
push 3, 8
popa 2, 1

; END
push 4, 3
push 1, 1
popa 2, 3
dup 1, 1
popa 1, 3
